Revit 2027 API
TemporaryGraphicsManager.GetAll Method
 Returns all temporary graphics object indexes managed by this manager.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<int> GetAll()
Public Function GetAll As ICollection(Of Integer)
public:
ICollection<int>^ GetAll()
member GetAll : unit -> ICollection<int>
Return Value
ICollection<Int32>
 Collection of temporary graphics object indexes managed by this manager.
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace